# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Laurent\Documents\PSoC Creator\4.4\VHN7040AY\Labo_Autom\VNH7040_modifie.cydsn\VNH7040_modifie.cyprj
# Date: Sun, 06 Jun 2021 17:35:20 GMT
#set_units -time ns
create_clock -name {Clock_2(FFB)} -period 250000 -waveform {0 125000} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {Clock_3(FFB)} -period 30.303030303030305 -waveform {0 15.1515151515152} [list [get_pins {ClockBlock/ff_div_9}]]
create_clock -name {UART_SCBCLK(FFB)} -period 121.21212121212122 -waveform {0 60.6060606060606} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {Clock_1(FFB)} -period 60.606060606060609 -waveform {0 30.3030303030303} [list [get_pins {ClockBlock/ff_div_10}]]
create_clock -name {CyRouted1} -period 30.303030303030305 -waveform {0 15.1515151515152} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 30.303030303030305 -waveform {0 15.1515151515152} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 30.303030303030305 -waveform {0 15.1515151515152} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 30.303030303030305 -waveform {0 15.1515151515152} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 8251 16501} -nominal_period 250000 [list]
create_generated_clock -name {Clock_4} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list [get_pins {ClockBlock/udb_div_0}]]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/hfclk}] -edges {1 2 3} [list]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 9} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list]


# Component constraints for C:\Users\Laurent\Documents\PSoC Creator\4.4\VHN7040AY\Labo_Autom\VNH7040_modifie.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Laurent\Documents\PSoC Creator\4.4\VHN7040AY\Labo_Autom\VNH7040_modifie.cydsn\VNH7040_modifie.cyprj
# Date: Sun, 06 Jun 2021 17:35:16 GMT
